def greet():
    print("Добро пожаловать в программу -весы-!\n")
    print("Управление:\nВвод Esc = вывод\nВвод от a1 до a11 = выбор первой гири (их порядок: [0.05, 0.1, 0.2, 0.5, 1, 2, 5, 10, 20, 50, 100]\nВторой ввод = ваша гиря\nВвод add_a = добавляет втроую гирю от a1 до a11\nВвод add_b = добавляет вашу гирю любых размеров\n")
    print("После вывода вы узнайте информацию о 2 сторонах, такие как: КТО БОЛЬШЕ, КТО МЕНЬШЕ, РАЗНИЦА, НА СКОЛЬКО БОЛЬШЕ, РАЗНОСТЬ И СУММУ\n")

def proggram():
    Vesi = [0.05, 0.1, 0.2, 0.5, 1, 2, 5, 10, 20, 50, 100]
    inputitovano = None

if __name__ == "__main__":
    greet()
